In [1]:
import numpy as np
import pandas as pd

In [2]:
lst = [1,2,3,4,5]

In [3]:
np.array(lst)

array([1, 2, 3, 4, 5])

In [4]:
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
[lst,lst,lst]

[[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]]

In [6]:
pd.DataFrame([lst,lst,lst], columns=['A','B','C','D','E'])

   A  B  C  D  E
0  1  2  3  4  5
1  1  2  3  4  5
2  1  2  3  4  5

In [7]:
df = pd.DataFrame([lst,lst,lst], columns=['A','B','C','D','E'])
df

   A  B  C  D  E
0  1  2  3  4  5
1  1  2  3  4  5
2  1  2  3  4  5

In [8]:
import pandas as pd
lst = ['Geeks', 'For','Geeks']
df = pd.DataFrame(lst)
print(df)

       0
0  Geeks
1    For
2  Geeks

In [9]:
#Pandas Series
#A pandas series is a 1d array capable of holding data of any type(float,integer,string,python objects etc)
#Creating a series using the Pandas Library.
import pandas as pd
import numpy as np
#Creating empty series
ser = pd.Series()
print("Pandas Series: ", ser)
#Simple array
data = np.array(['g','e','e','k','s'])
ser = pd.Series(data)
print("Pandas Series:\n", ser)

Pandas Series:  Series([], dtype: object)
Pandas Series:
 0    g
1    e
2    e
3    k
4    s
dtype: object

In [10]:
#Pandas DataFrame
#A Dataframe is a 2d structure constructed with rows and columns similar to excel spreadsheets
#Creating a DataFrame Using the Pandas Library
import pandas as pd
#calling dataframe constructor
df = pd.DataFrame()
print(df)
#List of strings
lst = ["Geeks","for",'Geeks','is','a','portal','for','geeks']
#calling dataframe constructor on lst
df = pd.DataFrame(lst)
print(df)

Empty DataFrame
Columns: []
Index: []
        0
0   Geeks
1     for
2   Geeks
3      is
4       a
5  portal
6     for
7   geeks

In [11]:
#Creating an Empty DataFrame
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [12]:
#Creating a DataFrame from a List
import pandas as pd
lst = ['Geeks','For','Geeks']
df = pd.DataFrame(lst)
print(df)

       0
0  Geeks
1    For
2  Geeks

In [13]:
#Creating DataFrame from dict of Numpy Array
import numpy as np
import pandas as pd
data = np.array([[1,2,3],[4,5,6],[7,8,9]])
df = pd.DataFrame(data, columns= ['A','B','C'])
print(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
#Creating a DataFrame from a List of Dictionaries  
import pandas as pd
dict = {'name':["aparna","Pankaj","sudhir","Geeku"],
       'degree': ["MBA","BCA","M.Tech","MBA"],
       'score':[90,40,80,98]}
df = pd.DataFrame(dict)
print(df)

     name  degree  score
0  aparna     MBA     90
1  Pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [15]:
#Python Pandas Series
import pandas as pd
#simple array
data = [1,2,3,4]
ser = pd.Series(data)
print(ser)

0    1
1    2
2    3
3    4
dtype: int64

In [16]:
#Creating a Pandas Series
#Creating a series from array:in order to create a series from an array,we have to import a numpy module and have to use array() function.
import pandas as pd
import numpy as np
data = np.array(['g','e','e','k','s'])
ser = pd.Series(data)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [17]:
#creating a series from list
#In order to create a series from list, we have to first create a list after that we can create a series from list.
import pandas as pd
#a simple list
list = ['g','e','e','k','s']
#create a series from the list
ser = pd.Series(list)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [18]:
#Accessing element of Series
#There are two ways through which we can access element of series, they are :
#Accessing Element from Series with Position
#Accessing Element Using Label (index)
#Accessing first 5 elements of Series.
import pandas as pd
import numpy as np
#creating a simple array
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data)
#retrieve the first element
print(ser[:5])

0    g
1    e
2    e
3    k
4    s
dtype: object

In [19]:
#Accessing Last 10 Elements of Series
import pandas as pd
import numpy as np
#create simple array
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data)
print(ser[-10:])

3     k
4     s
5     f
6     o
7     r
8     g
9     e
10    e
11    k
12    s
dtype: object

In [20]:
#Accessing Element Using Label (index) :
#Accessing a single element using index label.
import pandas as pd
import numpy as np
#create a simple array
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data,index=[10,11,12,13,14,15,16,17,18,19,20,21,22])
#accessing a element using index element
print(ser[16])

o

In [21]:
#Accessing a Multiple Element Using index Label
import pandas as pd
import numpy as np
#creating simple array
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data,index=[10,11,12,13,14,15,16,17,18,19,20,21,22])
#accesing a multiple element using 
#index element
print(ser[[10,11,12,13,14]])

10    g
11    e
12    e
13    k
14    s
dtype: object

In [22]:
#Access Multiple Elements by Providing Label of Index
import pandas as pd
import numpy as np
ser = pd.Series(np.arange(3,9),index = ['a','b','c','d','e','f'])
print(ser[['a','d']])

a    3
d    6
dtype: int32

In [23]:
#Binary Operations on Pandas Series
#Performing Binary Operations
import pandas as pd
ser1 = pd.Series([1,2,3],index=['A','B','C'])
ser2 = pd.Series([4,5,6],index=['A','B','C'])
df_sum = ser1.add(ser2)
print(df_sum)
#Each element of ser1 is added to the corresponding element of ser2 by matching the index labels (A,B,C).

A    5
B    7
C    9
dtype: int64

In [24]:
#Conversion Operation on Series
import pandas as pd
ser = pd.Series([1,2,3,4])
ser = ser.astype(float)
print(ser)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [25]:
#Creating an Empty Pandas Series
import pandas as pd
ser = pd.Series()
print(ser)

Series([], dtype: object)

In [26]:
#Creating a Series from a Numpy Array
import pandas as pd
import numpy as np
data = np.array(['g','e','e','k','s'])
ser = pd.Series(data)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [27]:
#Creating a Series from a List
import pandas as pd
data_list = ['g','e','e','k','s']
ser = pd.Series(data_list)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [28]:
#Creating a Series from a Dictionary
import pandas as pd
data_dict = {'Geeks':10, 'For':20, 'geeks':30}
ser = pd.Series(data_dict)
print(ser)

Geeks    10
For      20
geeks    30
dtype: int64

In [29]:
#Creating a Series Using NumPy Functions
import pandas as pd
import numpy as np
ser = pd.Series(np.linspace(1,10,5))
print(ser)

0     1.00
1     3.25
2     5.50
3     7.75
4    10.00
dtype: float64

In [30]:
#Creating a Series Using range()
import pandas as pd
ser = pd.Series(range(5,15))
print(ser)

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

In [31]:
#Creating a Series Using List Comprehension
import pandas as pd
ser = pd.Series(range(1,20,3),index=[x for x in 'abcdefg'])
print(ser)

a     1
b     4
c     7
d    10
e    13
f    16
g    19
dtype: int64

In [32]:
import pandas as pd

df = pd.read_csv('nba.csv') 
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [33]:
df = pd.read_csv('nba.csv')
display(df.head(10))

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

In [34]:
#Python | Pandas Dataframe/Series.head() method
import pandas as pd
data = pd.read_csv('nba.csv')
data_top = data.head()
data_top

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [35]:
#Calling on Series with n parameter()
import pandas as pd
data = pd.read_csv('nba.csv')
#number of rows to return
n = 9
# creating Series
Series = data["Name"]
# returning top n rows
top = Series.head(n = n)
#display
top

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
7     Kelly Olynyk
8     Terry Rozier
Name: Name, dtype: object

In [36]:
#Pandas Dataframe/Series.tail() method – Python
import pandas as pd
data = pd.read_csv('nba.csv')
print(data.tail())

             Name       Team  Number Position   Age Height  Weight College  \
453  Shelvin Mack  Utah Jazz     8.0       PG  26.0    6-3   203.0  Butler
454     Raul Neto  Utah Jazz    25.0       PG  24.0    6-1   179.0     NaN
455  Tibor Pleiss  Utah Jazz    21.0        C  26.0    7-3   256.0     NaN
456   Jeff Withey  Utah Jazz    24.0        C  26.0    7-0   231.0  Kansas
457           NaN        NaN     NaN      NaN   NaN    NaN     NaN     NaN

        Salary
453  2433333.0
454   900000.0
455  2900000.0
456   947276.0
457        NaN

In [37]:
#Getting the Last 12 Rows of a Series
import pandas as pd
data = pd.read_csv('nba.csv')
n = 12
Series = data["Team"]
print(Series.tail(n))

446    Utah Jazz
447    Utah Jazz
448    Utah Jazz
449    Utah Jazz
450    Utah Jazz
451    Utah Jazz
452    Utah Jazz
453    Utah Jazz
454    Utah Jazz
455    Utah Jazz
456    Utah Jazz
457          NaN
Name: Team, dtype: object

In [38]:
#Pandas DataFrame describe() Method
import pandas as pd
#Reading the CSV File
data = pd.read_csv('nba.csv')
#Displaying the first few rows of the dataset
print('NBA Dataset: ')
display(data.head())
print(" \n Summarry Table Generated by .describe() Method: ")
display(data.describe())
#Descriptive Statistics for Numerical Columns generated using .describe() Method
#count: Total number of non-null values in the column.
#mean: Average value of the column.
#std: Standard deviation, showing how spread out the values are.
#min: Minimum value in the column.
#25%: 25th percentile (Q1).
#50%: Median value (50th percentile).
#75%: 75th percentile (Q3).
#max: Maximum value in the column.

NBA Dataset:

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

 Summarry Table Generated by .describe() Method:

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [39]:
#Customizing describe() Method with Percentiles
#You can customize the describe() method to include specific percentiles by passing a list to the percentiles parameter. 
#Here’s an example:
percentiles = [.20, .40, .60, .80]
include = ['object', 'float', 'int']

desc = data.describe(percentiles=percentiles, include=include)

display(desc)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,457,457,457.000000,457,457.000000,457,457.000000,373,4.460000e+02
unique,457,30,NaN,5,NaN,18,NaN,118,NaN
top,Avery Bradley,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,19,NaN,102,NaN,59,NaN,22,NaN
mean,NaN,NaN,17.678337,NaN,26.938731,NaN,221.522976,NaN,4.842684e+06
std,NaN,NaN,15.966090,NaN,4.404016,NaN,26.368343,NaN,5.229238e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,3.088800e+04
20%,NaN,NaN,4.000000,NaN,23.000000,NaN,195.600000,NaN,9.472760e+05
40%,NaN,NaN,10.000000,NaN,25.000000,NaN,213.400000,NaN,1.938840e+06
50%,NaN,NaN,13.000000,NaN,26.000000,NaN,220.000000,NaN,2.839073e+06
60%,NaN,NaN,18.600000,NaN,27.000000,NaN,230.000000,NaN,3.815000e+06
80%,NaN,NaN,30.000000,NaN,30.000000,NaN,245.000000,NaN,8.042895e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,307.000000,NaN,2.500000e+07

In [40]:
#Describing Series of Strings (Object Data Type)
#If you want to describe a column with string data (i.e., an object data type), the output will be different. Here’s an example using the “Name” column from the dataset:
desc = data["Name"].describe()
print(desc)

count               457
unique              457
top       Avery Bradley
freq                  1
Name: Name, dtype: object

In [41]:
#Dealing with Rows and Columns in Pandas DataFrame
#Dealing with Columns
#Column Selection
import pandas as pd
data = {'Name': ['Jai', 'Princi','Gaurav','Anuj'],
       'Age':[27,24,22,32],
       'Address':['Delhi','Kanpur','Allahabad','Kannauj'],
       'Qualification':['Msc','MA','MCA','Phd']}
#convert the dictionary into a DataFrame
df = pd.DataFrame(data)
#select two columns
display(df[['Name', 'Qualification']])

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [42]:
#In Order to add a column in Pandas DataFrame, we can declare a new list as a column and add to a existing Dataframe.
import pandas as pd
# define a dictionary containing students data
data = {'Name': ['Jai','Princi','Gaurav','Anuj'],
       'Height': [5.1,6.2,5.1,5.2],
       'Qualification': ['Msc','MA','Msc','Msc']}
#convert the dictionary into a DataFrame
df = pd.DataFrame(data)
#Declare a list that is to be converted into a column
address = ['Delhi','Kanpur','Allahabad','Kannauj']
#using Address as the column name and equating it to the list
df['Adress'] = address
#observe the result
display(df)

     Name  Height Qualification     Adress
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA     Kanpur
2  Gaurav     5.1           Msc  Allahabad
3    Anuj     5.2           Msc    Kannauj

In [43]:
#In Order to delete a column in Pandas DataFrame, we can use the drop() method.
import pandas as pd
#making a DataFrame from the csv file
data = pd.read_csv('nba.csv', index_col="Name")
#dropping passed columns
data.drop(["Team", "Weight"], axis = 1, inplace = True)
#display
display(data)

               Number Position   Age Height            College     Salary
Name
Avery Bradley     0.0       PG  25.0    6-2              Texas  7730337.0
Jae Crowder      99.0       SF  25.0    6-6          Marquette  6796117.0
John Holland     30.0       SG  27.0    6-5  Boston University        NaN
R.J. Hunter      28.0       SG  22.0    6-5      Georgia State  1148640.0
Jonas Jerebko     8.0       PF  29.0   6-10                NaN  5000000.0
...               ...      ...   ...    ...                ...        ...
Shelvin Mack      8.0       PG  26.0    6-3             Butler  2433333.0
Raul Neto        25.0       PG  24.0    6-1                NaN   900000.0
Tibor Pleiss     21.0        C  26.0    7-3                NaN  2900000.0
Jeff Withey      24.0        C  26.0    7-0             Kansas   947276.0
NaN               NaN      NaN   NaN    NaN                NaN        NaN

[458 rows x 6 columns]

In [44]:
#Dealing with Rows:
#.loc function
import pandas as pd
data = pd.read_csv('nba.csv', index_col = "Name")
#retrieving row by loc method
first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]
print(first, "\n\n\n", second)

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [45]:
#In Order to add a Row in Pandas DataFrame, we can concat the old dataframe with new one.
# importing pandas module 
import pandas as pd 
  
# making data frame 
df = pd.read_csv('nba.csv', index_col = "Name") 

df.head(10)

new_row = pd.DataFrame({'Name':'Geeks', 'Team':'Boston', 'Number':3,
                        'Position':'PG', 'Age':33, 'Height':'6-2',
                        'Weight':189, 'College':'MIT', 'Salary':99999},
                                                            index =[0])
# simply concatenate both dataframes
df = pd.concat([new_row, df]).reset_index(drop = True)
df.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Geeks,Boston,3.0,PG,33.0,6-2,189.0,MIT,99999.0
1,NaN,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
2,NaN,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
3,NaN,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
4,NaN,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
5,NaN,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
6,NaN,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
7,NaN,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
8,NaN,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
9,NaN,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0

In [46]:
#In Order to delete a row in Pandas DataFrame, we can use the drop() method. Rows is deleted by dropping Rows by index label.
#importing pandas module
import pandas as pd
data = pd.read_csv('nba.csv', index_col = "Name")
#dropping passed values
data.drop(["Avery Bradley","John Holland","R.J. Hunter","R.J. Hunter"], inplace= True)
#display
data

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [47]:
#Examples of Extracting rows using .loc[]
#Multiple parameters
import pandas as pd
data = pd.read_csv('nba.csv', index_col="Name")
#retrieving rows by loc method
rows = data.loc[["Avery Bradley","R.J. Hunter"]]
print(type(rows))
rows

<class 'pandas.core.frame.DataFrame'>

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0

In [48]:
#Extracting multiple rows with same index
import pandas as pd
data = pd.read_csv("nba.csv", index_col="Team")
#retrieving rows by loc method
rows = data.loc["Utah Jazz"]
print(type(rows))
rows

<class 'pandas.core.frame.DataFrame'>

,Name,Number,Position,Age,Height,Weight,College,Salary
Team,,,,,,,,
Utah Jazz,Trevor Booker,33.0,PF,28.0,6-8,228.0,Clemson,4775000.0
Utah Jazz,Trey Burke,3.0,PG,23.0,6-1,191.0,Michigan,2658240.0
Utah Jazz,Alec Burks,10.0,SG,24.0,6-6,214.0,Colorado,9463484.0
Utah Jazz,Dante Exum,11.0,PG,20.0,6-6,190.0,NaN,3777720.0
Utah Jazz,Derrick Favors,15.0,PF,24.0,6-10,265.0,Georgia Tech,12000000.0
Utah Jazz,Rudy Gobert,27.0,C,23.0,7-1,245.0,NaN,1175880.0
Utah Jazz,Gordon Hayward,20.0,SF,26.0,6-8,226.0,Butler,15409570.0
Utah Jazz,Rodney Hood,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
Utah Jazz,Joe Ingles,2.0,SF,28.0,6-8,226.0,NaN,2050000.0
Utah Jazz,Chris Johnson,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
Utah Jazz,Trey Lyles,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
Utah Jazz,Shelvin Mack,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Utah Jazz,Raul Neto,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Utah Jazz,Tibor Pleiss,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Utah Jazz,Jeff Withey,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [49]:
#Extracting rows between two index labels
import pandas as pd
data = pd.read_csv('nba.csv', index_col="Name")
#retrieving rows by loc method
rows = data.loc["Avery Bradley":"Isaiah Thomas"]
print(type(rows))
rows
#As shown in the output image, all the rows that fall between passed two index labels are returned in the form of a data frame.

<class 'pandas.core.frame.DataFrame'>

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0
Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0

In [50]:
#Extracting Rows using Pandas .iloc[] in Python
#Selecting rows using Pandas .iloc and loc
import pandas as pd
data = pd.read_csv('nba.csv')
#retrieving rows by loc method
row1 = data.loc[3]
#retrieving rows by iloc method
row2 = data.iloc[3]
#checking if values are equal
row1 == row2

Name        True
Team        True
Number      True
Position    True
Age         True
Height      True
Weight      True
College     True
Salary      True
Name: 3, dtype: bool

In [51]:
#Selecting Multiple Rows using Pandas .iloc[] in Python
#In this example, multiple rows are extracted, first by passing a list and then by passing integers to extract rows between that range. After that, both values are compared. 
import pandas as pd
data = pd.read_csv('nba.csv')
#retrieving rows by loc method
row1 = data.loc[[4,5,6,7]]
row2 = data.iloc[4:8]
#comparing values
row1 == row2
# the results returned by both methods are the same. All values are True except values in the college column since those were NaN values.

   Name  Team  Number  Position   Age  Height  Weight  College  Salary
4  True  True    True      True  True    True    True    False    True
5  True  True    True      True  True    True    True    False    True
6  True  True    True      True  True    True    True     True    True
7  True  True    True      True  True    True    True     True    True

In [52]:
#Select Rows by Name or Index usingPandas .iloc[] in Python
import pandas as pd
#creating a sample DataFrame
data = pd.DataFrame({
    'Name': ['Geek1','Geek2','Geek3','Geek4','Geek5'],
    'Age': [25,30,22,35,28],
    'Salary':[50000,60000,45000,70000,55000]
})
#setting Name column as the index for clarity
data.set_index('Name', inplace=True)
#Displaying the original DataFrame
print("Original DataFrame:")
print(data)
#Extracting a single row by index
row_alice = data.iloc[0, :]
print("\nExtracted Row(Geek1):")
print(row_alice)
#Extracting multiple rows using a slice
rows_geek2_to_geek3 = data.iloc[1:3, :]
display(rows_geek2_to_geek3)

Original DataFrame:
       Age  Salary
Name
Geek1   25   50000
Geek2   30   60000
Geek3   22   45000
Geek4   35   70000
Geek5   28   55000

Extracted Row(Geek1):
Age          25
Salary    50000
Name: Geek1, dtype: int64

       Age  Salary
Name
Geek2   30   60000
Geek3   22   45000

In [53]:
#Indexing and Selecting Data with Pandas
#Indexing Data using the [] Operator
#To select a single column, you simply reference the column name inside square brackets:
import pandas as pd

# Load the data
data = pd.read_csv("nba.csv", index_col="Name")
print("Dataset")
display(data.head(5))

# Select a single column
first = data["Age"]
print("\nSingle Column selected from Dataset")
display(first.head(5))

Dataset

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

Single Column selected from Dataset

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
Name: Age, dtype: float64

In [54]:
#Selecting Multiple Columns
#To select multiple columns, pass a list of column names:
first = data[["Age", "College", "Salary"]]
print("\n Multiple columns from Dataset")
display(first.head(5))

 Multiple columns from Dataset

                Age            College     Salary
Name
Avery Bradley  25.0              Texas  7730337.0
Jae Crowder    25.0          Marquette  6796117.0
John Holland   27.0  Boston University        NaN
R.J. Hunter    22.0      Georgia State  1148640.0
Jonas Jerebko  29.0                NaN  5000000.0

In [55]:
#Indexing a DataFrame using .loc[ ]
#To select a single row, provide the row label inside the .loc[] function:
import pandas as pd
#making DataFrame from csv file
data = pd.read_csv('nba.csv', index_col="Name")
#retrieving row by loc method
first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]
third = data.loc["Jonas Jerebko"]
print(first, "\n\n\n", second)

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [56]:
#Selecting multiple rows
#For multiple rows, pass a list of row labels to .loc[]:
#select multiple rows
first = data.loc[["Avery Bradley","R.J. Hunter"]]
display(first)

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0

In [57]:
#Selecting Specific Rows and Columns
#To select specific rows and columns, provide both row labels and column names as lists:
#select two rows and three columns
first = data.loc[["Avery Bradley","R.J. Hunter",],["Team","Number","Position"]]
display(first)

                         Team  Number Position
Name
Avery Bradley  Boston Celtics     0.0       PG
R.J. Hunter    Boston Celtics    28.0       SG

In [58]:
#Selecting all of the rows and some columns
#To select all rows and specific columns, use a colon [:] to indicate all rows, followed by the list of column names:
#select all rows and specific columns
first = data.loc[:, ["Team", "Number","Position"]]
display(first)

                         Team  Number Position
Name
Avery Bradley  Boston Celtics     0.0       PG
Jae Crowder    Boston Celtics    99.0       SF
John Holland   Boston Celtics    30.0       SG
R.J. Hunter    Boston Celtics    28.0       SG
Jonas Jerebko  Boston Celtics     8.0       PF
...                       ...     ...      ...
Shelvin Mack        Utah Jazz     8.0       PG
Raul Neto           Utah Jazz    25.0       PG
Tibor Pleiss        Utah Jazz    21.0        C
Jeff Withey         Utah Jazz    24.0        C
NaN                       NaN     NaN      NaN

[458 rows x 3 columns]

In [59]:
#select all the columns and some rows
#To select all columns and some rows, use a list of row names followed by a colon {:}
first = data.loc[["Jonas Jerebko","R.J. Hunter","Avery Bradley"],:]
display(first)

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0

In [60]:
#Indexing a DataFrame using .iloc[ ]
#Selecting a Single Row
import pandas as pd
data = pd.read_csv('nba.csv', index_col="Name")
#Select a single row by position
row2 = data.iloc[3]
print(row2)

Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [61]:
#Selecting Multiple Rows
#To select multiple rows, pass a list of integer positions:
row2 = data.iloc[[3,5,7]]
display(row2)

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0

In [62]:
#Selecting Specific Rows and Columns
#To select specific rows and columns, provide integer positions for both rows and columns:
#select two rows and two columns by position
row2 = data.iloc[[3,4],[1,2]]
display(row2)

               Number Position
Name
R.J. Hunter      28.0       SG
Jonas Jerebko     8.0       PF

In [63]:
#Selecting All Rows and Some Columns
row2 = data.iloc[:,[1,2]]
display(row2)

               Number Position
Name
Avery Bradley     0.0       PG
Jae Crowder      99.0       SF
John Holland     30.0       SG
R.J. Hunter      28.0       SG
Jonas Jerebko     8.0       PF
...               ...      ...
Shelvin Mack      8.0       PG
Raul Neto        25.0       PG
Tibor Pleiss     21.0        C
Jeff Withey      24.0        C
NaN               NaN      NaN

[458 rows x 2 columns]

In [64]:
#selecting all columns and some rows
row2 = data.iloc[[1,2,],:]
display(row2)

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [65]:
#Boolean Indexing in Pandas
#Accessing a DataFrame with a boolean index: 
#In order to access a dataframe with a boolean index, we have to create a dataframe in which the index of dataframe contains a boolean value that is "True" or "False".
import pandas as pd
#dictionary of lists
dict = {'name':["aparna","pankaj","sudhir","Geeku"],
       'degree':["MBA","BCA","M.TECH","MBA"],
       'score':[90,40,80,98]}
df = pd.DataFrame(dict, index = [True, False, True, False])
display(df)

         name  degree  score
True   aparna     MBA     90
False  pankaj     BCA     40
True   sudhir  M.TECH     80
False   Geeku     MBA     98

In [66]:
#Accessing a Dataframe with a boolean index using .loc[]
#In order to access a dataframe with a boolean index using .loc[], we simply pass a boolean value (True or False) in a .loc[] function. 
import pandas as pd
#dictionary of lists
dict = {'name':["aparna","pankaj","sudhir","Geeku"],
       'degree':["MBA","BCA","M.TECH","MBA"],
       'score':[90,40,80,98]}
#creating a DataFrame with a boolean index
df = pd.DataFrame(dict, index= [True,False,True,False])
#accessing a dataframe using .loc[] function
display(df.loc[True])

        name  degree  score
True  aparna     MBA     90
True  sudhir  M.TECH     80

In [67]:
# a Dataframe with a boolean index using .iloc[]
#In order to access a dataframe using .iloc[], we have to pass a boolean value (True or False)  but iloc[] function accepts only integer as an argument so it will throw an error so we can only access a dataframe when we pass an integer in iloc[] function 
import pandas as pd
dict = {'name':["aparna","pankaj","sudhir","Geeku"],
       'degree':["MBA","BCA","M.TECH","MBA"],
       'score':[90,40,80,98]}
#creating a DataFrame with boolean index
df = pd.DataFrame(dict, index= [True,False,True,False])
#accesing a DataFrame using .iloc[] function
display(df.iloc[3])

name      Geeku
degree      MBA
score        98
Name: False, dtype: object

In [70]:
#Applying a boolean mask to a dataframe : 
import pandas as pd
#dictionary of lists
{'name':["aparna","pankaj","sudhir","Geeku"],
       'degree':["MBA","BCA","M.TECH","MBA"],
       'score':[90,40,80,98]}
df = pd.DataFrame(dict, index=[0,1,2,3])
df[[False,True,False,True]]

     name degree  score
1  pankaj    BCA     40
3   Geeku    MBA     98

In [72]:
import pandas as pd
#making a DataFrame from a csv file
data = pd.read_csv('nba.csv')
df = pd.DataFrame(data, index = [0,1,2,3,4,5,6,7,8,9,10,11,12])
df[[True, False, True, False, True,
    False, True, False, True, False,
                True, False, True]]
#This is boolean indexing. You are passing a list of booleans to filter the rows.

#You provided: [True, False, True, False]

#This tells Pandas: Select only the rows where the value is True.

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
10,Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0
12,Evan Turner,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0

In [74]:
#Masking data based on column value: 
import pandas as pd
#dictionary of Lists
dict = {'name':["aparna","pankaj","sudhir","Geeku"],
       'degree':["MBA","BCA","M.TECH","MBA"],
       'score':[90,40,80,98]}
#creating a DataFrame
df = pd.DataFrame(dict)
#using a comparison operator for filtering of data
print(df['degree'] == 'BCA')

0    False
1     True
2    False
3    False
Name: degree, dtype: bool

In [78]:
import pandas as pd
data = pd.read_csv('nba.csv',index_col='Name')
#using greater than operator for filtering of data
print(data['Age']>25)

Name
Avery Bradley    False
Jae Crowder      False
John Holland      True
R.J. Hunter      False
Jonas Jerebko     True
                 ...
Shelvin Mack      True
Raul Neto        False
Tibor Pleiss      True
Jeff Withey       True
NaN              False
Name: Age, Length: 458, dtype: bool

In [79]:
#Masking data based on index value : 
import pandas as pd
dict = {'name':["aparna","pankaj","sudhir","Geeku"],
       'degree':["MBA","BCA","M.TECH","MBA"],
       'score':[90,40,80,98]}
df = pd.DataFrame(dict, index=[0,1,2,3])
mask = df.index == 0
df[mask]

     name degree  score
0  aparna    MBA     90

In [81]:
import pandas as pd
data = pd.read_csv('nba.csv')
#giving index to the DataFrame
df = pd.DataFrame(data, index=[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15])
#filtering data based on index value
mask = df.index > 7
df[mask]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
10,Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0
12,Evan Turner,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0
13,James Young,Boston Celtics,13.0,SG,20.0,6-6,215.0,Kentucky,1749840.0
14,Tyler Zeller,Boston Celtics,44.0,C,26.0,7-0,253.0,North Carolina,2616975.0
15,Bojan Bogdanovic,Brooklyn Nets,44.0,SG,27.0,6-8,216.0,NaN,3425510.0

In [85]:
#Pandas Series.str.slice()
# Example #1: In this example, the salary column has been sliced to get values before decimal
# For example, we want to do some mathematical operations and for that we need integer data, so the salary column will be sliced till the 2nd last element(-2 position). 
#Since the salary column is imported as float64 data type, it is first converted to string using the .astype() method.
import pandas as pd
#making DataFrame
data = pd.read_csv('nba.csv')
#removing null values to avoid errors
data.dropna(inplace=True)
#start,stop and step variables
start,stop,step = 0,-2,1
#converting to string data type
data['Salary']=data['Salary'].astype(str)
#slicing till 2nd last element
data['Salary(int)'] = data["Salary"].str.slice(start,stop,step)
#display
data.head(15)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Salary(int)
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,7730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,6796117
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,1148640
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0,1170960
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0,2165160
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0,1824360
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0,3431040
10,Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0,2569260
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0,6912869
12,Evan Turner,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0,3425510
13,James Young,Boston Celtics,13.0,SG,20.0,6-6,215.0,Kentucky,1749840.0,1749840
14,Tyler Zeller,Boston Celtics,44.0,C,26.0,7-0,253.0,North Carolina,2616975.0,2616975
16,Markel Brown,Brooklyn Nets,22.0,SG,24.0,6-3,190.0,Oklahoma State,845059.0,845059
17,Wayne Ellington,Brooklyn Nets,21.0,SG,28.0,6-4,200.0,North Carolina,1500000.0,1500000
18,Rondae Hollis-Jefferson,Brooklyn Nets,24.0,SG,21.0,6-7,220.0,Arizona,1335480.0,1335480

In [87]:
#Example #2: In this example, the name column is sliced and step parameter is kept 2. Hence it will be stepping two characters during slicing.
import pandas as pd
#making a DataFrame
data = pd.read_csv('nba.csv')
#removing null values to avoid errors
data.dropna(inplace=True)
#start,stop and step variables
start,stop,step = 0,-2,2
#slicing till 2nd last element
data['Name'] = data['Name'].str.slice(start,stop,step)
#display
data.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,AeyBal,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,JeCod,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
3,RJ ut,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
6,Jra ik,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,KlyOy,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,TryRz,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Mru m,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
10,JrdSlig,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0
11,Iaa hm,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0
12,Ea un,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0

In [1]:
#How to take column-slices of DataFrame in Pandas?
#Creating Dataframe to slice columns
import pandas as pd
df1 = pd.DataFrame({
    "a":[1,2,3,4,5,6,7],
    "b":[2,3,4,2,3,4,5],
    "c":[3,4,5,2,3,4,5],
    "d":[4,5,6,2,3,4,5],
    "e":[5,6,7,2,3,4,5]
})
display(df1)

   a  b  c  d  e
0  1  2  3  4  5
1  2  3  4  5  6
2  3  4  5  6  7
3  4  2  2  2  2
4  5  3  3  3  3
5  6  4  4  4  4
6  7  5  5  5  5

In [2]:
#Slice Columns in pandas using reindex
#Slicing column from 'c' to 'b'.
df2 = df1.reindex(columns= ['c','b'])
display(df2)

   c  b
0  3  2
1  4  3
2  5  4
3  2  2
4  3  3
5  4  4
6  5  5

In [4]:
#Slice Columns in pandas using loc[]
#Slicing column from 'b' to 'd' with step 2.
df2 = df1.loc[:,"b":"d":2]
display(df2)

   b  d
0  2  4
1  3  5
2  4  6
3  2  2
4  3  3
5  4  4
6  5  5

In [12]:
#Slicing column from 'c' to 'e' with step 1.
df2 = df1.loc[:, "c":"e":1]
display(df2)

   c  d  e
0  3  4  5
1  4  5  6
2  5  6  7
3  2  2  2
4  3  3  3
5  4  4  4
6  5  5  5

In [15]:
# Slice Columns in pandas using iloc[]
#Slicing column from '1' to '3' with step 1.
df2 = df1.iloc[:, 1:3:1]
display(df2)

   b  c
0  2  3
1  3  4
2  4  5
3  2  2
4  3  3
5  4  4
6  5  5

In [16]:
#Slicing column from '0' to '3' with step 2.
df2 = df1.iloc[:,0:3:2]
display(df2)

   a  c
0  1  3
1  2  4
2  3  5
3  4  2
4  5  3
5  6  4
6  7  5

In [22]:
#Pandas Series.apply()
#Use Series.apply() function to change the city name to 'Montreal' if the city is 'Rio'.
import pandas as pd
#creating the Series
sr = pd.Series(['New York', 'Chicago','Toronto','Lisbon','Rio'])
#create the index
index_ = ['City1','City2','City3','City4','City5']
#set the index
sr.index = index_
#print the Series
print(sr)
#Now we will use Series.apply() function to change the city name to 'Montreal' if the city is 'Rio'
#change 'Rio' to 'Montreal'
#we have used a lambda function
result = sr.apply(lambda x : 'Montreal' if x == 'Rio' else x)
#print the result
print(result)

City1    New York
City2     Chicago
City3     Toronto
City4      Lisbon
City5         Rio
dtype: object
City1    New York
City2     Chicago
City3     Toronto
City4      Lisbon
City5    Montreal
dtype: object

In [5]:
#Use Series.apply() function to return True if the value in the given series object is greater than 30 else return False.
import pandas as pd
#creating the Series
sr = pd.Series([11,21,8,18,65,18,32,10,5,32,None])
#Create the index
#apply yearly frequency
index_ = pd.date_range('2010-10-09 08:45',periods = 11, freq = 'Y')
#set the index
sr.index = index_
#print the Series
print(sr)
#Now we will use Series.apply() function to return True if a value in the given series object is greater than 30 else return False.
#return true if greater than 30
#else return False
result = sr.apply(lambda x : True if x > 30 else False)
#print the result
print(result)

2010-12-31 08:45:00    11.0
2011-12-31 08:45:00    21.0
2012-12-31 08:45:00     8.0
2013-12-31 08:45:00    18.0
2014-12-31 08:45:00    65.0
2015-12-31 08:45:00    18.0
2016-12-31 08:45:00    32.0
2017-12-31 08:45:00    10.0
2018-12-31 08:45:00     5.0
2019-12-31 08:45:00    32.0
2020-12-31 08:45:00     NaN
Freq: A-DEC, dtype: float64
2010-12-31 08:45:00    False
2011-12-31 08:45:00    False
2012-12-31 08:45:00    False
2013-12-31 08:45:00    False
2014-12-31 08:45:00     True
2015-12-31 08:45:00    False
2016-12-31 08:45:00     True
2017-12-31 08:45:00    False
2018-12-31 08:45:00    False
2019-12-31 08:45:00     True
2020-12-31 08:45:00    False
Freq: A-DEC, dtype: bool

In [14]:
#Applying User-Defined Function to Every Row of Pandas DataFrame
import pandas as pd

# Function to add values from columns A, B, and C
def add_values(row):
    return row['A'] + row['B'] + row['C']

def main():
    # Create a dictionary with three fields
    data = {
        'A': [1, 2, 3],
        'B': [4, 5, 6],
        'C': [7, 8, 9]
    }

    # Convert the dictionary into a DataFrame
    df = pd.DataFrame(data)
    print("Original DataFrame:\n", df)

    # Apply the user-defined function to every row
    df['sum'] = df.apply(add_values, axis=1)

    # Print the new DataFrame
    print('\nAfter applying Function:')
    display(df)

# Ensure main() runs only if this script is executed directly
if __name__ == '__main__':
    main()

Original DataFrame:
    A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

After applying Function:

   A  B  C  sum
0  1  4  7   12
1  2  5  8   15
2  3  6  9   18

In [26]:
#Apply Lambda to Every Row of DataFrame
import pandas as pd
#Function to add
def add(a,b,c):
    return a + b + c

def main():
    #create a dictionary with three fields each
    data = {
        'A': [1,2,3],
        'B': [4,5,6],
        'C': [7,8,9]
    }
    #convert the dictionary into a DataFrame
    df = pd.DataFrame(data)
    print('Original DataFrame:\n',df)
    df['sum'] = df.apply(lambda row: add(row['A'], row['B'], row['C']), axis=1)
    print('\nAfter Applying Function: ')
    #displaying the new DataFrame
    display(df)

if __name__ == '__main__':
    main()

Original DataFrame:
    A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

After Applying Function:

   A  B  C  sum
0  1  4  7   12
1  2  5  8   15
2  3  6  9   18

In [27]:
#Apply NumPy.sum() to Every Row
import pandas as pd
import numpy as np
def main():
    #create a dictionary with five fields each
    data = {
        'A': [1,2,3],
        'B': [4,5,6],
        'C': [7,8,9]
    }
    #convert the dictionary into a DataFrame
    df = pd.DataFrame(data)
    print("Original DataFrame:\n",df)
    #applying function to each row in the DataFrame and storing result in a new column
    df['Sum'] = df.apply(np.sum, axis=1)
    print('\nAfter Applying Function: ')
    #printing the new DataFrame
    display(df)

if __name__ == '__main__':
    main()

Original DataFrame:
    A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

After Applying Function:

   A  B  C  Sum
0  1  4  7   12
1  2  5  8   15
2  3  6  9   18